# Combine (Join) Operations

In [22]:
import numpy as np
import pandas as pd
m = np.random.randint(1, 30, size = (5, 3))
df1 = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df1

   var1  var2  var3
0     7     8    29
1    12     3    17
2    10    23     3
3    22    15    20
4    20    10    21

In [23]:
df2 = df1 ** 2

In [24]:
df2

   var1  var2  var3
0    49    64   841
1   144     9   289
2   100   529     9
3   484   225   400
4   400   100   441

In [25]:
pd.concat([df1, df2])

   var1  var2  var3
0     7     8    29
1    12     3    17
2    10    23     3
3    22    15    20
4    20    10    21
0    49    64   841
1   144     9   289
2   100   529     9
3   484   225   400
4   400   100   441

In [26]:
pd.concat([df1, df2], ignore_index = True)

   var1  var2  var3
0     7     8    29
1    12     3    17
2    10    23     3
3    22    15    20
4    20    10    21
5    49    64   841
6   144     9   289
7   100   529     9
8   484   225   400
9   400   100   441

In [27]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [28]:
df.columns.dtype

dtype('O')

In [29]:
df.values

array([[24, 19,  9],
       [ 8, 15, 19],
       [19,  4, 15],
       [ 3, 16, 13],
       [28, 27, 11]])

In [30]:
df.values.dtype

dtype('int32')

In [31]:
df2.columns = ["var1", "var2", "deg3"]

In [32]:
pd.concat([df1, df2])

   var1  var2  var3   deg3
0     7     8  29.0    NaN
1    12     3  17.0    NaN
2    10    23   3.0    NaN
3    22    15  20.0    NaN
4    20    10  21.0    NaN
0    49    64   NaN  841.0
1   144     9   NaN  289.0
2   100   529   NaN    9.0
3   484   225   NaN  400.0
4   400   100   NaN  441.0

In [37]:
pd.concat([df1, df2], join="inner")

   var1  var2
0     7     8
1    12     3
2    10    23
3    22    15
4    20    10
0    49    64
1   144     9
2   100   529
3   484   225
4   400   100

In [49]:
pd.concat([df1, df2])

   var1  var2  var3   deg3
0     7     8  29.0    NaN
1    12     3  17.0    NaN
2    10    23   3.0    NaN
3    22    15  20.0    NaN
4    20    10  21.0    NaN
0    49    64   NaN  841.0
1   144     9   NaN  289.0
2   100   529   NaN    9.0
3   484   225   NaN  400.0
4   400   100   NaN  441.0